namespace Task_19_01
{
    internal class Program
    {
        /*1.Напишите программу, в которой пользователь вводит произвольный текст в консоли,     
         * после чего программа запрашивает подстроку для поиска. 
         * Если подстрока найдена - то программа запрашивает текст для того чтобы заменить на него эту подстроку 
         * (столько раз, сколько раз подстрока встречена в тексте)
        Пример:
        Введите строку: "Привет, мир!"
        Введите подстроку для поиска: "мир"
        Введите подстроку для замены: "друг"
        Результат: "Привет, друг!"

         */
        private static void Main(string[] args)
        {
            Console.Write("Введите строку: ");
            string text = Console.ReadLine();
            Console.Write("Введите подстроку для поиска: ");
            string str = Console.ReadLine();
            Console.Write("Введите подстроку для замены: ");
            string str2 = Console.ReadLine();
            text = text.Replace(str, str2);
            Console.Write($"Результат: {text}");
        }
    }
}